xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090xC.h
/********************************* Bit definition for LCD_INTCLR register *******************************************/
#define LCD_INTCLR_BKFC_Pos                       (16U)
#define LCD_INTCLR_BKFC_Msk                       (0x1UL<<LCD_INTCLR_BKFC_Pos)                      /*!< 0x00010000 */
#define LCD_INTCLR_BKFC                           LCD_INTCLR_BKFC_Msk                               
#define LCD_INTCLR_SOFC_Pos                       (17U)
#define LCD_INTCLR_SOFC_Msk                       (0x1UL<<LCD_INTCLR_SOFC_Pos)                      /*!< 0x00020000 */
#define LCD_INTCLR_SOFC                           LCD_INTCLR_SOFC_Msk                               
#define LCD_INTCLR_UDDC_Pos                       (18U)
#define LCD_INTCLR_UDDC_Msk                       (0x1UL<<LCD_INTCLR_UDDC_Pos)                      /*!< 0x00040000 */
#define LCD_INTCLR_UDDC                           LCD_INTCLR_UDDC_Msk                               

/********************************* Bit definition for LCD_POEN0 register ********************************************/
#define LCD_POEN0_SX_Pos                          (0U)
#define LCD_POEN0_SX_Msk                          (0xFFFFFFFFUL<<LCD_POEN0_SX_Pos)                  /*!< 0xFFFFFFFF */
#define LCD_POEN0_SX                              LCD_POEN0_SX_Msk

/********************************* Bit definition for LCD_POEN1 register ********************************************/
#define LCD_POEN1_SX_Pos                          (0U)
#define LCD_POEN1_SX_Msk                          (0xFUL<<LCD_POEN1_SX_Pos)                         /*!< 0x0000000F */
#define LCD_POEN1_SX                              LCD_POEN1_SX_Msk
#define LCD_POEN1_SX_0                            (0x1UL<<LCD_POEN1_SX_Pos)                         /*!< 0x00000001 */
#define LCD_POEN1_SX_1                            (0x2UL<<LCD_POEN1_SX_Pos)                         /*!< 0x00000002 */
#define LCD_POEN1_SX_2                            (0x4UL<<LCD_POEN1_SX_Pos)                         /*!< 0x00000004 */
#define LCD_POEN1_SX_3                            (0x8UL<<LCD_POEN1_SX_Pos)                         /*!< 0x00000008 */
#define LCD_POEN1_SXCY_Pos                        (4U)
#define LCD_POEN1_SXCY_Msk                        (0xFUL<<LCD_POEN1_SXCY_Pos)                       /*!< 0x000000F0 */
#define LCD_POEN1_SXCY                            LCD_POEN1_SXCY_Msk
#define LCD_POEN1_SXCY_0                          (0x1UL<<LCD_POEN1_SXCY_Pos)                       /*!< 0x00000010 */
#define LCD_POEN1_SXCY_1                          (0x2UL<<LCD_POEN1_SXCY_Pos)                       /*!< 0x00000020 */
#define LCD_POEN1_SXCY_2                          (0x4UL<<LCD_POEN1_SXCY_Pos)                       /*!< 0x00000040 */
#define LCD_POEN1_SXCY_3                          (0x8UL<<LCD_POEN1_SXCY_Pos)                       /*!< 0x00000080 */
#define LCD_POEN1_CX_Pos                          (8U)
#define LCD_POEN1_CX_Msk                          (0xFUL<<LCD_POEN1_CX_Pos)                         /*!< 0x00000F00 */
#define LCD_POEN1_CX                              LCD_POEN1_CX_Msk
#define LCD_POEN1_CX_0                            (0x1UL<<LCD_POEN1_CX_Pos)                         /*!< 0x00000100 */
#define LCD_POEN1_CX_1                            (0x2UL<<LCD_POEN1_CX_Pos)                         /*!< 0x00000200 */
#define LCD_POEN1_CX_2                            (0x4UL<<LCD_POEN1_CX_Pos)                         /*!< 0x00000400 */
#define LCD_POEN1_CX_3                            (0x8UL<<LCD_POEN1_CX_Pos)                         /*!< 0x00000800 */

/********************************* Bit definition for LCD_RAM0 register *********************************************/
#define LCD_RAM0_DX_Pos                           (0U)
#define LCD_RAM0_DX_Msk                           (0xFFFFFFFFUL<<LCD_RAM0_DX_Pos)                   /*!< 0xFFFFFFFF */
#define LCD_RAM0_DX                               LCD_RAM0_DX_Msk

/********************************* Bit definition for LCD_RAM1 register *********************************************/
#define LCD_RAM1_DX_Pos                           (0U)
#define LCD_RAM1_DX_Msk                           (0xFFFFFFFFUL<<LCD_RAM1_DX_Pos)                   /*!< 0xFFFFFFFF */
#define LCD_RAM1_DX                               LCD_RAM1_DX_Msk

/********************************* Bit definition for LCD_RAM2 register *********************************************/
#define LCD_RAM2_DX_Pos                           (0U)
#define LCD_RAM2_DX_Msk                           (0xFFFFFFFFUL<<LCD_RAM2_DX_Pos)                   /*!< 0xFFFFFFFF */
#define LCD_RAM2_DX                               LCD_RAM2_DX_Msk

/********************************* Bit definition for LCD_RAM3 register *********************************************/
#define LCD_RAM3_DX_Pos                           (0U)
#define LCD_RAM3_DX_Msk                           (0xFFFFFFFFUL<<LCD_RAM3_DX_Pos)                   /*!< 0xFFFFFFFF */
#define LCD_RAM3_DX                               LCD_RAM3_DX_Msk

/********************************* Bit definition for LCD_RAM4 register *********************************************/
#define LCD_RAM4_DX_Pos                           (0U)
#define LCD_RAM4_DX_Msk                           (0xFFFFFFFFUL<<LCD_RAM4_DX_Pos)                   /*!< 0xFFFFFFFF */
#define LCD_RAM4_DX                               LCD_RAM4_DX_Msk

/********************************* Bit definition for LCD_RAM5 register *********************************************/
#define LCD_RAM5_DX_Pos                           (0U)
#define LCD_RAM5_DX_Msk                           (0xFFFFFFFFUL<<LCD_RAM5_DX_Pos)                   /*!< 0xFFFFFFFF */
#define LCD_RAM5_DX                               LCD_RAM5_DX_Msk

/********************************* Bit definition for LCD_RAM6 register *********************************************/
#define LCD_RAM6_DX_Pos                           (0U)
#define LCD_RAM6_DX_Msk                           (0xFFFFFFFFUL<<LCD_RAM6_DX_Pos)                   /*!< 0xFFFFFFFF */
#define LCD_RAM6_DX                               LCD_RAM6_DX_Msk

/********************************* Bit definition for LCD_RAM7 register *********************************************/
#define LCD_RAM7_DX_Pos                           (0U)
#define LCD_RAM7_DX_Msk                           (0xFFFFFFFFUL<<LCD_RAM7_DX_Pos)                   /*!< 0xFFFFFFFF */
#define LCD_RAM7_DX                               LCD_RAM7_DX_Msk

/********************************* Bit definition for LCD_RAM8 register *********************************************/
#define LCD_RAM8_DX_Pos                           (0U)
#define LCD_RAM8_DX_Msk                           (0xFFUL<<LCD_RAM8_DX_Pos)                         /*!< 0x000000FF */
#define LCD_RAM8_DX                               LCD_RAM8_DX_Msk

/********************************* Bit definition for LCD_RAM9 register *********************************************/
#define LCD_RAM9_DX_Pos                           (0U)
#define LCD_RAM9_DX_Msk                           (0xFFUL<<LCD_RAM9_DX_Pos)                         /*!< 0x000000FF */
#define LCD_RAM9_DX                               LCD_RAM9_DX_Msk

