xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090xC.h
/********************************************************************************************************************/
/********************************* OPA ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for OPA_OCR register **********************************************/
#define OPA_OCR_OPA_EXTOEN_Pos                    (0U)
#define OPA_OCR_OPA_EXTOEN_Msk                    (0x1UL<<OPA_OCR_OPA_EXTOEN_Pos)                   /*!< 0x00000001 */
#define OPA_OCR_OPA_EXTOEN                        OPA_OCR_OPA_EXTOEN_Msk                            
#define OPA_OCR_OPA_EXTOSEL_Pos                   (1U)
#define OPA_OCR_OPA_EXTOSEL_Msk                   (0x3UL<<OPA_OCR_OPA_EXTOSEL_Pos)                  /*!< 0x00000006 */
#define OPA_OCR_OPA_EXTOSEL                       OPA_OCR_OPA_EXTOSEL_Msk 
#define OPA_OCR_OPA_EXTOSEL_0                     (0x1UL<<OPA_OCR_OPA_EXTOSEL_Pos)                  /*!< 0x00000002 */  
#define OPA_OCR_OPA_EXTOSEL_1                     (0x2UL<<OPA_OCR_OPA_EXTOSEL_Pos)                  /*!< 0x00000004 */                          

/********************************* Bit definition for OPA_CR register ***********************************************/
#define OPA_CR_OPA_VINPSEL_Pos                    (0U)
#define OPA_CR_OPA_VINPSEL_Msk                    (0x1UL<<OPA_CR_OPA_VINPSEL_Pos)                   /*!< 0x00000001 */
#define OPA_CR_OPA_VINPSEL                        OPA_CR_OPA_VINPSEL_Msk                            
#define OPA_CR_OPA_VINMSEL_Pos                    (2U)
#define OPA_CR_OPA_VINMSEL_Msk                    (0x1UL<<OPA_CR_OPA_VINMSEL_Pos)                   /*!< 0x00000004 */
#define OPA_CR_OPA_VINMSEL                        OPA_CR_OPA_VINMSEL_Msk                            
#define OPA_CR_OPAEN_Pos                          (5U)
#define OPA_CR_OPAEN_Msk                          (0x1UL<<OPA_CR_OPAEN_Pos)                         /*!< 0x00000020 */
#define OPA_CR_OPAEN                              OPA_CR_OPAEN_Msk                                  

/********************************* Bit definition for OPA_TMR register **********************************************/
#define OPA_TMR_OPA_TM_Pos                        (0U)
#define OPA_TMR_OPA_TM_Msk                        (0x1UL<<OPA_TMR_OPA_TM_Pos)                       /*!< 0x00000001 */
#define OPA_TMR_OPA_TM                            OPA_TMR_OPA_TM_Msk                                
                            


/********************************************************************************************************************/
/********************************* PWR ******************************************************************************/
/********************************************************************************************************************/
#define PWR_PVD_SUPPORT                       /*!< PWR feature available only on specific devices: Power Voltage Detection feature */

/********************************* Bit definition for PWR_CR1 register **********************************************/
#define PWR_CR1_LPMS_Pos                          (0U)
#define PWR_CR1_LPMS_Msk                          (0x7UL<<PWR_CR1_LPMS_Pos)                         /*!< 0x00000007 */
#define PWR_CR1_LPMS                              PWR_CR1_LPMS_Msk
#define PWR_CR1_LPMS_0                            (0x1UL<<PWR_CR1_LPMS_Pos)                         /*!< 0x00000001 */
#define PWR_CR1_LPMS_1                            (0x2UL<<PWR_CR1_LPMS_Pos)                         /*!< 0x00000002 */
#define PWR_CR1_LPMS_2                            (0x4UL<<PWR_CR1_LPMS_Pos)                         /*!< 0x00000004 */
#define PWR_CR1_DBP_Pos                           (8U)
#define PWR_CR1_DBP_Msk                           (0x1UL<<PWR_CR1_DBP_Pos)                          /*!< 0x00000100 */
#define PWR_CR1_DBP                               PWR_CR1_DBP_Msk                                   
#define PWR_CR1_VR_MODE_Pos                       (9U)
#define PWR_CR1_VR_MODE_Msk                       (0x3UL<<PWR_CR1_VR_MODE_Pos)                      /*!< 0x00000600 */
#define PWR_CR1_VR_MODE                           PWR_CR1_VR_MODE_Msk
#define PWR_CR1_VR_MODE_0                         (0x1UL<<PWR_CR1_VR_MODE_Pos)                      /*!< 0x00000200 */
#define PWR_CR1_VR_MODE_1                         (0x2UL<<PWR_CR1_VR_MODE_Pos)                      /*!< 0x00000400 */
#define PWR_CR1_FLS_SLPTIME_Pos                   (12U)
#define PWR_CR1_FLS_SLPTIME_Msk                   (0x3UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00003000 */
#define PWR_CR1_FLS_SLPTIME                       PWR_CR1_FLS_SLPTIME_Msk
#define PWR_CR1_FLS_SLPTIME_0                     (0x1UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00001000 */
#define PWR_CR1_FLS_SLPTIME_1                     (0x2UL<<PWR_CR1_FLS_SLPTIME_Pos)                  /*!< 0x00002000 */
#define PWR_CR1_MR_VSEL_Pos                       (16U)
#define PWR_CR1_MR_VSEL_Msk                       (0x3UL<<PWR_CR1_MR_VSEL_Pos)                      /*!< 0x00003000 */
#define PWR_CR1_MR_VSEL                           PWR_CR1_MR_VSEL_Msk
#define PWR_CR1_MR_VSEL_0                         (0x1UL<<PWR_CR1_MR_VSEL_Pos)                      /*!< 0x00001000 */
#define PWR_CR1_MR_VSEL_1                         (0x2UL<<PWR_CR1_MR_VSEL_Pos)                      /*!< 0x00002000 */
#define PWR_CR1_LPR_VSEL_Pos                      (18U)
#define PWR_CR1_LPR_VSEL_Msk                      (0x3UL<<PWR_CR1_LPR_VSEL_Pos)                     /*!< 0x00003000 */
#define PWR_CR1_LPR_VSEL                          PWR_CR1_LPR_VSEL_Msk
#define PWR_CR1_LPR_VSEL_0                        (0x1UL<<PWR_CR1_LPR_VSEL_Pos)                     /*!< 0x00001000 */
#define PWR_CR1_LPR_VSEL_1                        (0x2UL<<PWR_CR1_LPR_VSEL_Pos)                     /*!< 0x00002000 */
#define PWR_CR1_DLPR_VSEL_Pos                     (20U)
#define PWR_CR1_DLPR_VSEL_Msk                     (0x3UL<<PWR_CR1_DLPR_VSEL_Pos)                    /*!< 0x00003000 */
#define PWR_CR1_DLPR_VSEL                         PWR_CR1_DLPR_VSEL_Msk
#define PWR_CR1_DLPR_VSEL_0                       (0x1UL<<PWR_CR1_DLPR_VSEL_Pos)                    /*!< 0x00001000 */
#define PWR_CR1_DLPR_VSEL_1                       (0x2UL<<PWR_CR1_DLPR_VSEL_Pos)                    /*!< 0x00002000 */
#define PWR_CR1_FLSSLP_CTRL_Pos                   (24U)
#define PWR_CR1_FLSSLP_CTRL_Msk                   (0x1UL<<PWR_CR1_FLSSLP_CTRL_Pos)                  /*!< 0x01000000 */
#define PWR_CR1_FLSSLP_CTRL                       PWR_CR1_FLSSLP_CTRL_Msk                           
#define PWR_CR1_HSION_CTRL_Pos                    (25U)
#define PWR_CR1_HSION_CTRL_Msk                    (0x1UL<<PWR_CR1_HSION_CTRL_Pos)                   /*!< 0x02000000 */
#define PWR_CR1_HSION_CTRL                        PWR_CR1_HSION_CTRL_Msk                            
#define PWR_CR1_STDBY_MRRDY_WAIT_Pos              (26U)
#define PWR_CR1_STDBY_MRRDY_WAIT_Msk              (0x3UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x0C000000 */
#define PWR_CR1_STDBY_MRRDY_WAIT                  PWR_CR1_STDBY_MRRDY_WAIT_Msk
#define PWR_CR1_STDBY_MRRDY_WAIT_0                (0x1UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x04000000 */
#define PWR_CR1_STDBY_MRRDY_WAIT_1                (0x2UL<<PWR_CR1_STDBY_MRRDY_WAIT_Pos)             /*!< 0x08000000 */

/********************************* Bit definition for PWR_CR2 register **********************************************/
#define PWR_CR2_PVDE_Pos                          (0U)
#define PWR_CR2_PVDE_Msk                          (0x1UL<<PWR_CR2_PVDE_Pos)                         /*!< 0x00000001 */
#define PWR_CR2_PVDE                              PWR_CR2_PVDE_Msk                                  
#define PWR_CR2_PVDT_Pos                          (4U)
#define PWR_CR2_PVDT_Msk                          (0x7UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000070 */
#define PWR_CR2_PVDT                              PWR_CR2_PVDT_Msk
#define PWR_CR2_PVDT_0                            (0x1UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000010 */
#define PWR_CR2_PVDT_1                            (0x2UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000020 */
#define PWR_CR2_PVDT_2                            (0x4UL<<PWR_CR2_PVDT_Pos)                         /*!< 0x00000040 */
#define PWR_CR2_PVD_OUT_SEL_Pos                   (7U)
#define PWR_CR2_PVD_OUT_SEL_Msk                   (0x1UL<<PWR_CR2_PVD_OUT_SEL_Pos)                  /*!< 0x00000080 */
#define PWR_CR2_PVD_OUT_SEL                       PWR_CR2_PVD_OUT_SEL_Msk                           
#define PWR_CR2_FLTEN_Pos                         (8U)
#define PWR_CR2_FLTEN_Msk                         (0x1UL<<PWR_CR2_FLTEN_Pos)                        /*!< 0x00000100 */
#define PWR_CR2_FLTEN                             PWR_CR2_FLTEN_Msk                                 
#define PWR_CR2_FLT_TIME_Pos                      (9U)
#define PWR_CR2_FLT_TIME_Msk                      (0x7UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000E00 */
#define PWR_CR2_FLT_TIME                          PWR_CR2_FLT_TIME_Msk
#define PWR_CR2_FLT_TIME_0                        (0x1UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000200 */
#define PWR_CR2_FLT_TIME_1                        (0x2UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000400 */
#define PWR_CR2_FLT_TIME_2                        (0x4UL<<PWR_CR2_FLT_TIME_Pos)                     /*!< 0x00000800 */
#define PWR_CR2_PVDT_1V8                          (0x00000000U)
#define PWR_CR2_PVDT_2V0                          (0x00000010U)
#define PWR_CR2_PVDT_2V2                          (0x00000020U)
#define PWR_CR2_PVDT_2V4                          (0x00000030U)
#define PWR_CR2_PVDT_2V8                          (0x00000040U)
#define PWR_CR2_PVDT_3V1                          (0x00000050U)
#define PWR_CR2_PVDT_3V7                          (0x00000060U)
#define PWR_CR2_PVDT_4V2                          (0x00000070U)

/********************************* Bit definition for PWR_CR3 register **********************************************/
#define PWR_CR3_EWUP0_Pos                         (0U)
#define PWR_CR3_EWUP0_Msk                         (0x1UL<<PWR_CR3_EWUP0_Pos)                        /*!< 0x00000001 */
#define PWR_CR3_EWUP0                             PWR_CR3_EWUP0_Msk                                 
#define PWR_CR3_EWUP1_Pos                         (1U)
#define PWR_CR3_EWUP1_Msk                         (0x1UL<<PWR_CR3_EWUP1_Pos)                        /*!< 0x00000002 */
#define PWR_CR3_EWUP1                             PWR_CR3_EWUP1_Msk                                 
#define PWR_CR3_EWUP2_Pos                         (2U)
#define PWR_CR3_EWUP2_Msk                         (0x1UL<<PWR_CR3_EWUP2_Pos)                        /*!< 0x00000004 */
#define PWR_CR3_EWUP2                             PWR_CR3_EWUP2_Msk                                 
#define PWR_CR3_EWUP3_Pos                         (3U)
#define PWR_CR3_EWUP3_Msk                         (0x1UL<<PWR_CR3_EWUP3_Pos)                        /*!< 0x00000008 */
#define PWR_CR3_EWUP3                             PWR_CR3_EWUP3_Msk                                 
#define PWR_CR3_EWUP4_Pos                         (4U)
#define PWR_CR3_EWUP4_Msk                         (0x1UL<<PWR_CR3_EWUP4_Pos)                        /*!< 0x00000010 */
#define PWR_CR3_EWUP4                             PWR_CR3_EWUP4_Msk                                 
#define PWR_CR3_EWUP5_Pos                         (5U)
#define PWR_CR3_EWUP5_Msk                         (0x1UL<<PWR_CR3_EWUP5_Pos)                        /*!< 0x00000020 */
#define PWR_CR3_EWUP5                             PWR_CR3_EWUP5_Msk                                 
#define PWR_CR3_EWUP6_Pos                         (6U)
#define PWR_CR3_EWUP6_Msk                         (0x1UL<<PWR_CR3_EWUP6_Pos)                        /*!< 0x00000040 */
#define PWR_CR3_EWUP6                             PWR_CR3_EWUP6_Msk                                 
#define PWR_CR3_EWUP7_Pos                         (7U)
#define PWR_CR3_EWUP7_Msk                         (0x1UL<<PWR_CR3_EWUP7_Pos)                        /*!< 0x00000080 */
#define PWR_CR3_EWUP7                             PWR_CR3_EWUP7_Msk                                 
#define PWR_CR3_EWUP_Pos                          (0U)
#define PWR_CR3_EWUP_Msk                          (0xFFUL<<PWR_CR3_EWUP_Pos)                        /*!< 0x000000FF */
#define PWR_CR3_EWUP                              PWR_CR3_EWUP_Msk                                 
#define PWR_CR3_LD_EN_Pos                         (8U)
#define PWR_CR3_LD_EN_Msk                         (0x1UL<<PWR_CR3_LD_EN_Pos)                        /*!< 0x00000100 */
#define PWR_CR3_LD_EN                             PWR_CR3_LD_EN_Msk                                 
#define PWR_CR3_APC_Pos                           (9U)
#define PWR_CR3_APC_Msk                           (0x1UL<<PWR_CR3_APC_Pos)                          /*!< 0x00000200 */
#define PWR_CR3_APC                               PWR_CR3_APC_Msk                                   
#define PWR_CR3_SRAM1PDSTD_Pos                    (10U)
#define PWR_CR3_SRAM1PDSTD_Msk                    (0x1UL<<PWR_CR3_SRAM1PDSTD_Pos)                   /*!< 0x00000400 */
#define PWR_CR3_SRAM1PDSTD                        PWR_CR3_SRAM1PDSTD_Msk                                   

/********************************* Bit definition for PWR_CR4 register **********************************************/
#define PWR_CR4_WP0_Pos                           (0U)
#define PWR_CR4_WP0_Msk                           (0x3UL<<PWR_CR4_WP0_Pos)                          /*!< 0x00000003 */
#define PWR_CR4_WP0                               PWR_CR4_WP0_Msk
#define PWR_CR4_WP0_0                             (0x1UL<<PWR_CR4_WP0_Pos)                          /*!< 0x00000001 */
#define PWR_CR4_WP0_1                             (0x2UL<<PWR_CR4_WP0_Pos)                          /*!< 0x00000002 */
#define PWR_CR4_WP1_Pos                           (2U)
#define PWR_CR4_WP1_Msk                           (0x3UL<<PWR_CR4_WP1_Pos)                          /*!< 0x0000000C */
#define PWR_CR4_WP1                               PWR_CR4_WP1_Msk
#define PWR_CR4_WP1_0                             (0x1UL<<PWR_CR4_WP1_Pos)                          /*!< 0x00000004 */
#define PWR_CR4_WP1_1                             (0x2UL<<PWR_CR4_WP1_Pos)                          /*!< 0x00000008 */
#define PWR_CR4_WP2_Pos                           (4U)
#define PWR_CR4_WP2_Msk                           (0x3UL<<PWR_CR4_WP2_Pos)                          /*!< 0x00000030 */
#define PWR_CR4_WP2                               PWR_CR4_WP2_Msk
#define PWR_CR4_WP2_0                             (0x1UL<<PWR_CR4_WP2_Pos)                          /*!< 0x00000010 */
#define PWR_CR4_WP2_1                             (0x2UL<<PWR_CR4_WP2_Pos)                          /*!< 0x00000020 */
#define PWR_CR4_WP3_Pos                           (6U)
#define PWR_CR4_WP3_Msk                           (0x3UL<<PWR_CR4_WP3_Pos)                          /*!< 0x000000C0 */
#define PWR_CR4_WP3                               PWR_CR4_WP3_Msk
#define PWR_CR4_WP3_0                             (0x1UL<<PWR_CR4_WP3_Pos)                          /*!< 0x00000040 */
#define PWR_CR4_WP3_1                             (0x2UL<<PWR_CR4_WP3_Pos)                          /*!< 0x00000080 */
#define PWR_CR4_WP4_Pos                           (8U)
#define PWR_CR4_WP4_Msk                           (0x3UL<<PWR_CR4_WP4_Pos)                          /*!< 0x00000300 */
#define PWR_CR4_WP4                               PWR_CR4_WP4_Msk
#define PWR_CR4_WP4_0                             (0x1UL<<PWR_CR4_WP4_Pos)                          /*!< 0x00000100 */
#define PWR_CR4_WP4_1                             (0x2UL<<PWR_CR4_WP4_Pos)                          /*!< 0x00000200 */
#define PWR_CR4_WP5_Pos                           (10U)
#define PWR_CR4_WP5_Msk                           (0x3UL<<PWR_CR4_WP5_Pos)                          /*!< 0x00000C00 */
#define PWR_CR4_WP5                               PWR_CR4_WP5_Msk
#define PWR_CR4_WP5_0                             (0x1UL<<PWR_CR4_WP5_Pos)                          /*!< 0x00000400 */
#define PWR_CR4_WP5_1                             (0x2UL<<PWR_CR4_WP5_Pos)                          /*!< 0x00000800 */
#define PWR_CR4_WP6_Pos                           (12U)
#define PWR_CR4_WP6_Msk                           (0x3UL<<PWR_CR4_WP6_Pos)                          /*!< 0x00003000 */
#define PWR_CR4_WP6                               PWR_CR4_WP6_Msk
#define PWR_CR4_WP6_0                             (0x1UL<<PWR_CR4_WP6_Pos)                          /*!< 0x00001000 */
#define PWR_CR4_WP6_1                             (0x2UL<<PWR_CR4_WP6_Pos)                          /*!< 0x00002000 */
#define PWR_CR4_WP7_Pos                           (14U)
#define PWR_CR4_WP7_Msk                           (0x3UL<<PWR_CR4_WP7_Pos)                          /*!< 0x0000C000 */
#define PWR_CR4_WP7                               PWR_CR4_WP7_Msk
#define PWR_CR4_WP7_0                             (0x1UL<<PWR_CR4_WP7_Pos)                          /*!< 0x00004000 */
#define PWR_CR4_WP7_1                             (0x2UL<<PWR_CR4_WP7_Pos)                          /*!< 0x00008000 */

/********************************* Bit definition for PWR_SR register ***********************************************/
#define PWR_SR_WUF0_Pos                           (0U)
#define PWR_SR_WUF0_Msk                           (0x1UL<<PWR_SR_WUF0_Pos)                          /*!< 0x00000001 */
#define PWR_SR_WUF0                               PWR_SR_WUF0_Msk                                   
#define PWR_SR_WUF1_Pos                           (1U)
#define PWR_SR_WUF1_Msk                           (0x1UL<<PWR_SR_WUF1_Pos)                          /*!< 0x00000002 */
#define PWR_SR_WUF1                               PWR_SR_WUF1_Msk                                   
#define PWR_SR_WUF2_Pos                           (2U)
#define PWR_SR_WUF2_Msk                           (0x1UL<<PWR_SR_WUF2_Pos)                          /*!< 0x00000004 */
#define PWR_SR_WUF2                               PWR_SR_WUF2_Msk                                   
#define PWR_SR_WUF3_Pos                           (3U)
#define PWR_SR_WUF3_Msk                           (0x1UL<<PWR_SR_WUF3_Pos)                          /*!< 0x00000008 */
#define PWR_SR_WUF3                               PWR_SR_WUF3_Msk                                   
#define PWR_SR_WUF4_Pos                           (4U)
#define PWR_SR_WUF4_Msk                           (0x1UL<<PWR_SR_WUF4_Pos)                          /*!< 0x00000010 */
#define PWR_SR_WUF4                               PWR_SR_WUF4_Msk                                   
#define PWR_SR_WUF5_Pos                           (5U)
#define PWR_SR_WUF5_Msk                           (0x1UL<<PWR_SR_WUF5_Pos)                          /*!< 0x00000020 */
#define PWR_SR_WUF5                               PWR_SR_WUF5_Msk                                   
#define PWR_SR_WUF6_Pos                           (6U)
#define PWR_SR_WUF6_Msk                           (0x1UL<<PWR_SR_WUF6_Pos)                          /*!< 0x00000040 */
#define PWR_SR_WUF6                               PWR_SR_WUF6_Msk                                   
#define PWR_SR_WUF7_Pos                           (7U)
#define PWR_SR_WUF7_Msk                           (0x1UL<<PWR_SR_WUF7_Pos)                          /*!< 0x00000080 */
#define PWR_SR_WUF7                               PWR_SR_WUF7_Msk                                   
#define PWR_SR_WUF_Pos                            (0U)
#define PWR_SR_WUF_Msk                            (0xFFUL<<PWR_SR_WUF_Pos)                          /*!< 0x000000FF */
#define PWR_SR_WUF                                PWR_SR_WUF_Msk                                   
#define PWR_SR_SBF_Pos                            (8U)
#define PWR_SR_SBF_Msk                            (0x1UL<<PWR_SR_SBF_Pos)                           /*!< 0x00000100 */
#define PWR_SR_SBF                                PWR_SR_SBF_Msk                                    
#define PWR_SR_MR_RDY_Pos                         (9U)
#define PWR_SR_MR_RDY_Msk                         (0x1UL<<PWR_SR_MR_RDY_Pos)                        /*!< 0x00000200 */
#define PWR_SR_MR_RDY                             PWR_SR_MR_RDY_Msk                                 
//#define PWR_SR_MR_VOS_RDY_Pos                     (10U)
//#define PWR_SR_MR_VOS_RDY_Msk                     (0x1UL<<PWR_SR_MR_VOS_RDY_Pos)                  /*!< 0x00000400 */
//#define PWR_SR_MR_VOS_RDY                         PWR_SR_MR_VOS_RDY_Msk                           
#define PWR_SR_LPRUN_RUN_SWF_Pos                  (11U)
#define PWR_SR_LPRUN_RUN_SWF_Msk                  (0x1UL<<PWR_SR_LPRUN_RUN_SWF_Pos)                 /*!< 0x00000800 */
#define PWR_SR_LPRUN_RUN_SWF                       PWR_SR_LPRUN_RUN_SWF_Msk                         
#define PWR_SR_IWDGRST_WUF_Pos                    (12U)
#define PWR_SR_IWDGRST_WUF_Msk                    (0x1UL<<PWR_SR_IWDGRST_WUF_Pos)                   /*!< 0x00001000 */
#define PWR_SR_IWDGRST_WUF                        PWR_SR_IWDGRST_WUF_Msk                            
#define PWR_SR_PINRST_WUF_Pos                     (13U)
#define PWR_SR_PINRST_WUF_Msk                     (0x1UL<<PWR_SR_PINRST_WUF_Pos)                    /*!< 0x00002000 */
#define PWR_SR_PINRST_WUF                         PWR_SR_PINRST_WUF_Msk                             
#define PWR_SR_VCC_PORF_Pos                       (14U)
#define PWR_SR_VCC_PORF_Msk                       (0x1UL<<PWR_SR_VCC_PORF_Pos)                      /*!< 0x00004000 */
#define PWR_SR_VCC_PORF                           PWR_SR_VCC_PORF_Msk                             
#define PWR_SR_PVDO_Pos                           (16U)
#define PWR_SR_PVDO_Msk                           (0x1UL<<PWR_SR_PVDO_Pos)                          /*!< 0x00010000 */
#define PWR_SR_PVDO                               PWR_SR_PVDO_Msk                                   

